app/controllers/cars_controller.rb

  def create
    @car = Car.new(car_params)

    if @car.save
---
INSERT INTO "cars" ("year", "make", "model", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["year", "1992"], ["make", "Nissan"], ["model", "240SX"], ["created_at", "2021-03-03 21:18:38.610708"], ["updated_at", "2021-03-03 21:18:38.610708"]]

    def set_car
      @car = Car.find(params[:id])
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]