app/controllers/clutches_controller.rb

  def index
    @clutches = Clutch.all
---
SELECT "clutches".* FROM "clutches"