app/controllers/differentials_controller.rb

SELECT "differentials".* FROM "differentials"
---
  def index
    @differentials = Differential.all