app/controllers/engines_controller.rb

  def index
    @engines = Engine.all
---
SELECT "engines".* FROM "engines"