app/controllers/hand_brakes_controller.rb

  def index
    @hand_brakes = HandBrake.all
---
SELECT "hand_brakes".* FROM "hand_brakes"

  def create
    @hand_brake = HandBrake.new(hand_brake_params)

    if @hand_brake.save
---
INSERT INTO "hand_brakes" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Cable"], ["created_at", "2021-03-03 21:10:44.619773"], ["updated_at", "2021-03-03 21:10:44.619773"]]