app/controllers/rollcages_controller.rb

  def index
    @rollcages = Rollcage.all
---
SELECT "rollcages".* FROM "rollcages"