app/controllers/suspensions_controller.rb

SELECT "suspensions".* FROM "suspensions"
---
  def index
    @suspensions = Suspension.all